# Ellipse Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Ellipse Class
Members See Also
---
A whole or partial ellipse.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class Ellipse : Curve
```

Visual Basic
---
```text
Public Class Ellipse _
	Inherits Curve
```

Visual C++
---
```text
public ref class Ellipse : public Curve
```

# Remarks
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..GeometryObject Autodesk.Revit.DB..::..Curve Autodesk.Revit.DB..::..Ellipse
# See Also
Ellipse Members
Autodesk.Revit.DB Namespace